{
  "1": {
    "id": 1,
    "title": "Gaza ceasefire talks",
    "tags": ["Politics", "Conflict", "Global"],
    "sourcesCount": 5,
    "lastUpdated": "Today",
    "combinedSummary": {
      "content": "Recent ceasefire negotiations have involved multiple international mediators with varying degrees of success. The discussions focus on humanitarian pauses, prisoner exchanges, and long-term security arrangements. While temporary truces have been achieved, lasting agreements remain elusive due to fundamental disagreements on core issues and external political pressures affecting the negotiation dynamics."
    },
    "blindSpots": {
      "items": [
        "Long-term reconstruction costs and funding sources",
        "Impact on civilian mental health and trauma",
        "Environmental damage from ongoing conflict",
        "Regional economic consequences beyond immediate actors"
      ]
    },
    "sources": [
      {
        "id": "A",
        "name": "Source A",
        "tone": "Alarmist",
        "frame": "Security",
        "summary": "Focuses on potential security collapse and frames the ceasefire as temporary at best, emphasizing military preparedness and strategic advantages.",
        "emoji": "😡"
      },
      {
        "id": "B",
        "name": "Source B",
        "tone": "Neutral",
        "frame": "Diplomatic",
        "summary": "Presents balanced coverage of negotiation positions, highlighting international mediation efforts and procedural aspects of the talks.",
        "emoji": "😐"
      },
      {
        "id": "C",
        "name": "Source C",
        "tone": "Optimistic",
        "frame": "Humanitarian",
        "summary": "Emphasizes humanitarian aspects and civilian benefits, focusing on aid delivery and temporary relief measures achieved through negotiations.",
        "emoji": "🙂"
      },
      {
        "id": "D",
        "name": "Source D",
        "tone": "Skeptical",
        "frame": "Political",
        "summary": "Questions motives of all parties involved, analyzing political gains and losses while expressing doubt about long-term success.",
        "emoji": "🤨"
      },
      {
        "id": "E",
        "name": "Source E",
        "tone": "Analytical",
        "frame": "Economic",
        "summary": "Examines economic implications and resource allocation, focusing on costs of conflict versus potential benefits of agreement.",
        "emoji": "📊"
      }
    ]
  }
}

